summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEth_regdef.h
/** \\brief  Register 66 - MMC Transmit Interrupt Register */
typedef struct _Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits
{
    unsigned int TXGBOCTIS:1;               /**< \brief [0:0] MMC Transmit Good Bad Octet Counter Interrupt Status (r) */
    unsigned int TXGBFRMIS:1;               /**< \brief [1:1] MMC Transmit Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TXBCGFIS:1;                /**< \brief [2:2] MMC Transmit Broadcast Good Frame Counter Interrupt Status (r) */
    unsigned int TXMCGFIS:1;                /**< \brief [3:3] MMC Transmit Multicast Good Frame Counter Interrupt Status (r) */
    unsigned int TX64OCTGBFIS:1;            /**< \brief [4:4] MMC Transmit 64 Octet Good Bad Frame Counter Interrupt Status. (r) */
    unsigned int TX65T127OCTGBFIS:1;        /**< \brief [5:5] MMC Transmit 65 to 127 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TX128T255OCTGBFIS:1;       /**< \brief [6:6] MMC Transmit 128 to 255 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TX256T511OCTGBFIS:1;       /**< \brief [7:7] MMC Transmit 256 to 511 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TX512T1023OCTGBFIS:1;      /**< \brief [8:8] MMC Transmit 512 to 1023 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TX1024TMAXOCTGBFIS:1;      /**< \brief [9:9] MMC Transmit 1024 to Maximum Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TXUCGBFIS:1;               /**< \brief [10:10] MMC Transmit Unicast Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TXMCGBFIS:1;               /**< \brief [11:11] MMC Transmit Multicast Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TXBCGBFIS:1;               /**< \brief [12:12] MMC Transmit Broadcast Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TXUFLOWERFIS:1;            /**< \brief [13:13] MMC Transmit Underflow Error Frame Counter Interrupt Status (r) */
    unsigned int TXSCOLGFIS:1;              /**< \brief [14:14] MMC Transmit Single Collision Good Frame Counter Interrupt Status (r) */
    unsigned int TXMCOLGFIS:1;              /**< \brief [15:15] MMC Transmit Multiple Collision Good Frame Counter Interrupt Status (r) */
    unsigned int TXDEFFIS:1;                /**< \brief [16:16] MMC Transmit Deferred Frame Counter Interrupt Status (r) */
    unsigned int TXLATCOLFIS:1;             /**< \brief [17:17] MMC Transmit Late Collision Frame Counter Interrupt Status (r) */
    unsigned int TXEXCOLFIS:1;              /**< \brief [18:18] MMC Transmit Excessive Collision Frame Counter Interrupt Status (r) */
    unsigned int TXCARERFIS:1;              /**< \brief [19:19] MMC Transmit Carrier Error Frame Counter Interrupt Status (r) */
    unsigned int TXGOCTIS:1;                /**< \brief [20:20] MMC Transmit Good Octet Counter Interrupt Status (r) */
    unsigned int TXGFRMIS:1;                /**< \brief [21:21] MMC Transmit Good Frame Counter Interrupt Status (r) */
    unsigned int TXEXDEFFIS:1;              /**< \brief [22:22] MMC Transmit Excessive Deferral Frame Counter Interrupt Status (r) */
    unsigned int TXPAUSFIS:1;               /**< \brief [23:23] MMC Transmit Pause Frame Counter Interrupt Status (r) */
    unsigned int TXVLANGFIS:1;              /**< \brief [24:24] MMC Transmit VLAN Good Frame Counter Interrupt Status (r) */
    unsigned int TXOSIZEGFIS:1;             /**< \brief [25:25] MMC Transmit Oversize Good Frame Counter Interrupt Status (r) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits;

/** \\brief  Register 68 - MMC Transmit Interrupt Mask Register */
typedef struct _Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits
{
    unsigned int TXGBOCTIM:1;               /**< \brief [0:0] MMC Transmit Good Bad Octet Counter Interrupt Mask (rw) */
    unsigned int TXGBFRMIM:1;               /**< \brief [1:1] MMC Transmit Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TXBCGFIM:1;                /**< \brief [2:2] MMC Transmit Broadcast Good Frame Counter Interrupt Mask (rw) */
    unsigned int TXMCGFIM:1;                /**< \brief [3:3] MMC Transmit Multicast Good Frame Counter Interrupt Mask (rw) */
    unsigned int TX64OCTGBFIM:1;            /**< \brief [4:4] MMC Transmit 64 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TX65T127OCTGBFIM:1;        /**< \brief [5:5] MMC Transmit 65 to 127 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TX128T255OCTGBFIM:1;       /**< \brief [6:6] MMC Transmit 128 to 255 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TX256T511OCTGBFIM:1;       /**< \brief [7:7] MMC Transmit 256 to 511 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TX512T1023OCTGBFIM:1;      /**< \brief [8:8] MMC Transmit 512 to 1023 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TX1024TMAXOCTGBFIM:1;      /**< \brief [9:9] MMC Transmit 1024 to Maximum Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TXUCGBFIM:1;               /**< \brief [10:10] MMC Transmit Unicast Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TXMCGBFIM:1;               /**< \brief [11:11] MMC Transmit Multicast Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TXBCGBFIM:1;               /**< \brief [12:12] MMC Transmit Broadcast Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TXUFLOWERFIM:1;            /**< \brief [13:13] MMC Transmit Underflow Error Frame Counter Interrupt Mask (rw) */
    unsigned int TXSCOLGFIM:1;              /**< \brief [14:14] MMC Transmit Single Collision Good Frame Counter Interrupt Mask (rw) */
    unsigned int TXMCOLGFIM:1;              /**< \brief [15:15] MMC Transmit Multiple Collision Good Frame Counter Interrupt Mask (rw) */
    unsigned int TXDEFFIM:1;                /**< \brief [16:16] MMC Transmit Deferred Frame Counter Interrupt Mask (rw) */
    unsigned int TXLATCOLFIM:1;             /**< \brief [17:17] MMC Transmit Late Collision Frame Counter Interrupt Mask (rw) */
    unsigned int TXEXCOLFIM:1;              /**< \brief [18:18] MMC Transmit Excessive Collision Frame Counter Interrupt Mask (rw) */
    unsigned int TXCARERFIM:1;              /**< \brief [19:19] MMC Transmit Carrier Error Frame Counter Interrupt Mask (rw) */
    unsigned int TXGOCTIM:1;                /**< \brief [20:20] MMC Transmit Good Octet Counter Interrupt Mask (rw) */
    unsigned int TXGFRMIM:1;                /**< \brief [21:21] MMC Transmit Good Frame Counter Interrupt Mask (rw) */
    unsigned int TXEXDEFFIM:1;              /**< \brief [22:22] MMC Transmit Excessive Deferral Frame Counter Interrupt Mask (rw) */
    unsigned int TXPAUSFIM:1;               /**< \brief [23:23] MMC Transmit Pause Frame Counter Interrupt Mask (rw) */
    unsigned int TXVLANGFIM:1;              /**< \brief [24:24] MMC Transmit VLAN Good Frame Counter Interrupt Mask (rw) */
    unsigned int TXOSIZEGFIM:1;             /**< \brief [25:25] MMC Transmit Oversize Good Frame Counter Interrupt Mask (rw) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits;

/** \\brief  Register 6 - Operation Mode Register */
typedef struct _Ifx_ETH_OPERATION_MODE_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int SR:1;                      /**< \brief [1:1] Start or Stop Receive (rw) */
    unsigned int OSF:1;                     /**< \brief [2:2] Operate on Second Frame (rw) */
    unsigned int RTC:2;                     /**< \brief [4:3] Receive Threshold Control (rw) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int FUF:1;                     /**< \brief [6:6] Forward Undersized Good Frames (rw) */
    unsigned int FEF:1;                     /**< \brief [7:7] Forward Error Frames (rw) */
    unsigned int EFC:1;                     /**< \brief [8:8] Enable HW Flow Control (rw) */
    unsigned int RFA:2;                     /**< \brief [10:9] Threshold for Activating Flow Control (in half-duplex and full-duplex) (rw) */
    unsigned int RFD:2;                     /**< \brief [12:11] Threshold for Deactivating Flow Control (in half-duplex and full-duplex) (rw) */
    unsigned int ST:1;                      /**< \brief [13:13] Start or Stop Transmission Command (rw) */
    unsigned int TTC:3;                     /**< \brief [16:14] Transmit Threshold Control (rw) */
    unsigned int reserved_17:3;             /**< \brief \internal Reserved */
    unsigned int FTF:1;                     /**< \brief [20:20] Flush Transmit FIFO (rw) */
    unsigned int TSF:1;                     /**< \brief [21:21] Transmit Store and Forward (rw) */
    unsigned int RFD2:1;                    /**< \brief [22:22] MSB of Threshold for Deactivating Flow Control (r) */
    unsigned int RFA2:1;                    /**< \brief [23:23] MSB of Threshold for Activating Flow Control (r) */
    unsigned int DFF:1;                     /**< \brief [24:24] Disable Flushing of Received Frames (rw) */
    unsigned int RSF:1;                     /**< \brief [25:25] Receive Store and Forward (rw) */
    unsigned int DT:1;                      /**< \brief [26:26] Disable Dropping of TCP/IP Checksum Error Frames (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ETH_OPERATION_MODE_Bits;

