summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEth_regdef.h
/** \\brief  Register 11 - PMT Control and Status Register */
typedef struct _Ifx_ETH_PMT_CONTROL_STATUS_Bits
{
    unsigned int PWRDWN:1;                  /**< \brief [0:0] Power Down (rw) */
    unsigned int MGKPKTEN:1;                /**< \brief [1:1] Magic Packet Enable (rw) */
    unsigned int RWKPKTEN:1;                /**< \brief [2:2] Wake-Up Frame Enable (rw) */
    unsigned int reserved_3:2;              /**< \brief \internal Reserved */
    unsigned int MGKPRCVD:1;                /**< \brief [5:5] Magic Packet Received (r) */
    unsigned int RWKPRCVD:1;                /**< \brief [6:6] Wake-Up Frame Received (r) */
    unsigned int reserved_7:2;              /**< \brief \internal Reserved */
    unsigned int GLBLUCAST:1;               /**< \brief [9:9] Global Unicast (rw) */
    unsigned int reserved_10:21;            /**< \brief \internal Reserved */
    unsigned int RWKFILTRST:1;              /**< \brief [31:31] Wake-Up Frame Filter Register Pointer Reset (rw) */
} Ifx_ETH_PMT_CONTROL_STATUS_Bits;

/** \\brief  Register 459 - PPS Control Register */
typedef struct _Ifx_ETH_PPS_CONTROL_Bits
{
    unsigned int PPSCTRL_PPSCMD:4;          /**< \brief [3:0] PPSCTRL0 or PPSCMD0 (rw) */
    unsigned int PPSEN0:1;                  /**< \brief [4:4] Flexible PPS Output Mode Enable (r) */
    unsigned int TRGTMODSEL0:2;             /**< \brief [6:5] Target Time Register Mode for PPS0 Output (r) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int PPSCMD1:3;                 /**< \brief [10:8] Flexible PPS1 Output Control (r) */
    unsigned int reserved_11:2;             /**< \brief \internal Reserved */
    unsigned int TRGTMODSEL1:2;             /**< \brief [14:13] Target Time Register Mode for PPS1 Output (r) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int PPSCMD2:3;                 /**< \brief [18:16] Flexible PPS2 Output Control (r) */
    unsigned int reserved_19:2;             /**< \brief \internal Reserved */
    unsigned int TRGTMODSEL2:2;             /**< \brief [22:21] Target Time Register Mode for PPS2 Output (r) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int PPSCMD3:3;                 /**< \brief [26:24] Flexible PPS3 Output Control (r) */
    unsigned int reserved_27:2;             /**< \brief \internal Reserved */
    unsigned int TRGTMODSEL3:2;             /**< \brief [30:29] Target Time Register Mode for PPS3 Output (r) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_ETH_PPS_CONTROL_Bits;

/** \\brief  Register 3 - Receive Descriptor List Address Register */
typedef struct _Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int RDESLA_32bit:30;           /**< \brief [31:2] Start of Receive List (rw) */
} Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits;

/** \\brief  Register 9 - Receive Interrupt Watchdog Timer Register */
typedef struct _Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits
{
    unsigned int RIWT:8;                    /**< \brief [7:0] RI Watchdog Timer Count (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits;

/** \\brief  Register 2 - Receive Poll Demand Register */
typedef struct _Ifx_ETH_RECEIVE_POLL_DEMAND_Bits
{
    unsigned int RPD:32;                    /**< \brief [31:0] Receive Poll Demand (rw) */
} Ifx_ETH_RECEIVE_POLL_DEMAND_Bits;

/** \\brief  Register 10 - Remote Wake-Up Frame Filter Register */
typedef struct _Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits
{
    unsigned int WKUPFRMFTR:32;             /**< \brief [31:0] WKUPFRMFTR (rw) */
} Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits;

/** \\brief  Register 112 - Receive Frame Count for Good and Bad 1,024 to
 * Maxsize Bytes Frames */
typedef struct _Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX1024_MAXOCTGB:32;        /**< \brief [31:0] RX1024_MAXOCTGB (r) */
} Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits;

/** \\brief  Register 109 - Receive Frame Count for Good and Bad 128 to 255
 * Bytes Frames */
typedef struct _Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX128_255OCTGB:32;         /**< \brief [31:0] RX128_255OCTGB (r) */
} Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits;

/** \\brief  Register 110 - Receive Frame Count for Good and Bad 256 to 511
 * Bytes Frames */
typedef struct _Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX256_511OCTGB:32;         /**< \brief [31:0] RX256_511OCTGB (r) */
} Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits;

/** \\brief  Register 111 - Receive Frame Count for Good and Bad 512 to 1,023
 * Bytes Frames */
typedef struct _Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX512_1023OCTGB:32;        /**< \brief [31:0] RX512_1023OCTGB (r) */
} Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits;

/** \\brief  Register 107 - Receive Frame Count for Good and Bad 64 Byte Frames */
typedef struct _Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX64OCTGB:32;              /**< \brief [31:0] RX64OCTGB (r) */
} Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits;

/** \\brief  Register 108 - Receive Frame Count for Good and Bad 65 to 127 Bytes
 * Frames */
typedef struct _Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX65_127OCTGB:32;          /**< \brief [31:0] RX65_127OCTGB (r) */
} Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits;

/** \\brief  Register 102 - Receive Frame Count for Alignment Error Frames */
typedef struct _Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits
{
    unsigned int RXALGNERR:32;              /**< \brief [31:0] RXALGNERR (r) */
} Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits;

/** \\brief  Register 99 - Receive Frame Count for Good Broadcast Frames */
typedef struct _Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits
{
    unsigned int RXBCASTG:32;               /**< \brief [31:0] RXBCASTG (r) */
} Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits;

